depwl9992/blinkm-projects/blinkmuino/hardware/blinkm/boards.txt
# "upload.using" takes "hardwarename:programmername" argument

blinkm45.name=BlinkM/MinM ATtiny45 w/ ArduinoISP
blinkm45.upload.using=arduino:arduinoisp
blinkm45.upload.maximum_size=4096
blinkm45.build.mcu=attiny45
blinkm45.build.f_cpu=8000000L
blinkm45.build.core=blinkm

blinkm85.name=BlinkM/MinM ATtiny85 w/ ArduinoISP
blinkm85.upload.using=arduino:arduinoisp
blinkm85.upload.maximum_size=8192
blinkm85.build.mcu=attiny85
blinkm85.build.f_cpu=8000000L
blinkm85.build.core=blinkm
blinkm85.upload.disable_flushing=true

blinkm45isp.name=BlinkM/MinM ATtiny45 w/ AVRISPmkII
blinkm45isp.upload.using=blinkm:avrispmkii
blinkm45isp.upload.maximum_size=4096
blinkm45isp.build.mcu=attiny45
blinkm45isp.build.f_cpu=8000000L
blinkm45isp.build.core=blinkm

blinkm85isp.name=BlinkM/MinM ATtiny85 w/ AVRISPmkII
blinkm85isp.upload.using=blinkm:avrispmkii
blinkm85isp.upload.maximum_size=8192
blinkm85isp.build.mcu=attiny85
blinkm85isp.build.f_cpu=8000000L
blinkm85isp.build.core=blinkm

